{
  "LanguageLabel": {
    "message": "Language",
    "description": "ToSStrings..ctor"
  },
  "AgreementLabel": {
    "message": "Nutzungsbedingungen",
    "description": "ToSStrings..ctor"
  },
  "ReadLabel": {
    "message": "BITTE LIES DIES SORGFÄLTIG",
    "description": "ToSStrings..ctor"
  },
  "Paragraph1": {
    "message": "Alle Moddateien, die aktuell auf deinem Charakter aktiv sind und dein Charakterzustand werden automatisch zu dem Service, an dem du dich registriert hast, hochgeladen. Das Plugin wird ausschließlich die nötigen Moddateien hochladen und nicht die gesamte Modifikation.",
    "description": "ToSStrings..ctor"
  },
  "Paragraph2": {
    "message": "Falls du mit einer getakteten Internetverbindung verbunden bist, können durch den Datentransfer von Hoch- und Runtergeladenen Moddateien höhere Kosten entstehen. Moddateien werden beim Hoch- und Runterladen komprimiert um Bandbreite zu sparen. Durch unterschiedliche Hoch- und Runterladgeschwindigkeiten ist es möglich, dass Änderungen an Charakteren nicht sofort sichtbar sind. Dateien die bereits auf dem Service existieren, werden nicht nochmals hochgeladen.",
    "description": "ToSStrings..ctor"
  },
  "Paragraph3": {
    "message": "Die Moddateien die du hochlädst sind vertraulich und werden nicht mit anderen Nutzern geteilt, die nicht die exakt selben Dateien anfordern. Bitte überlege dir sorgfältig mit wem du deinen Identifikationscode teilst, da es unvermeidlich ist, dass die andere Person deine Moddateien erhält und lokal zwischenspeichert. Lokal zwischengespeicherte Dateien haben willkürrliche Namen um vor Versuchen abzuschrecken die originalen Moddateien aus diesen wiederherzustellen.",
    "description": "ToSStrings..ctor"
  },
  "Paragraph4": {
    "message": "Der Ersteller des Plugins hat sein Bestes getan, um deine Sicherheit zu gewährleisten. Es gibt jedoch keine Garantie für 100%ige Sicherheit. Teile deinen Identifikationscode nicht blind mit jedem.",
    "description": "ToSStrings..ctor"
  },
  "Paragraph5": {
    "message": "Moddateien, die auf dem Service gespeichert sind, verbleiben auf dem Service, solange es Anforderungen für diese Dateien gibt. Nach einer Zeitspanne in der die Dateien nicht verwendet wurden, werden diese automatisch gelöscht. Du hast auch die Möglichkeit manuell alle Dateien auf dem Service zu löschen. Der Service hat keine Informationen welche Moddateien zu welcher Modifikation gehören.",
    "description": "ToSStrings..ctor"
  },
  "Paragraph6": {
    "message": "Dieser Dienst wird ohne Gewähr angeboten. Im Falle eines Missbrauchs tretet dem Mare Synchronos Discord bei.",
    "description": "ToSStrings..ctor"
  },
  "AgreeLabel": {
    "message": "Ich Stimme zu",
    "description": "ToSStrings..ctor"
  },
  "ButtonWillBeAvailableIn": {
    "message": "\"Ich stimme zu\" Knopf verfügbar in",
    "description": "ToSStrings..ctor"
  }
}