{
  "LanguageLabel": {
    "message": "Language",
    "description": "ToSStrings..ctor"
  },
  "AgreementLabel": {
    "message": "Nutzungsbedingungen",
    "description": "ToSStrings..ctor"
  },
  "ReadLabel": {
    "message": "LESE DIESE SORTFÄLTIG",
    "description": "ToSStrings..ctor"
  },
  "Paragraph1": {
    "message": "Alle Moddateien, die aktuell auf deinem Charakter aktiv sind sowohl dein Character Status werden automatisch zu dem Service an dem du dich registriert hast hochgeladen. Das Plugin wird ausschliesslich die nötigen Moddateien hochladen und nicht das gesamte Mod.",
    "description": "ToSStrings..ctor"
  },
  "Paragraph2": {
    "message": "Falls du mit einer Volumen-basierten Internetverbindung verbunden bist, können durch den Datentransfer von Hoch- und Runtergeladenen Moddateien höhere Kosten entstehen. Moddateien werden beim Hoch- und Runterladen komprimiert um Bandbreite zu sparen. Durch unterschiedliche Hoch- und Runterladgeschwindigkeiten ist es möglich, dass Änderungen an Charakteren nicht sofort sichtbar sind. Dateien die bereits auf dem Service existieren, werden nicht nochmals hochgeladen.",
    "description": "ToSStrings..ctor"
  },
  "Paragraph3": {
    "message": "Die Moddateien die du hochlädst sind vertraulich und werden nicht zu anderen Clients verteilt, die nicht die exakt selben Dateien anfordern. Bitte überlege dir sortfältig mit wem du paarst, da es unvermeidlich ist, dass die andere Person deine Moddateien erhalten und lokal zwischenspeichern wird. Lokal zwischengespeicherte Dateien haben willkürrliche Namen um vor Versuchen die originalen Modifikationen aus diesen wiederherzustellen abzuschrecken.",
    "description": "ToSStrings..ctor"
  },
  "Paragraph4": {
    "message": "Der Pluginersteller versuchte sein Bestes um dich sicher zu halten. Jedoch gibt es keine Garantie für 100% Sicherheit. Paare dich nicht blind mit jedem.",
    "description": "ToSStrings..ctor"
  },
  "Paragraph5": {
    "message": "Moddateien, die auf dem Service gespeichert sind, verbleiben auf dem Service solange es Anforderungen für diese Dateien gibt. Nach einer Zeitspanne in der die Dateien nicht verwendet wurden, werden diese automatisch gelöscht. Du hast auch die Möglichkeit manuell alle Dateien auf dem Service zu löschen. Der Service hat keine Informationen welche Moddateien zu welcher Modifikation gehören.",
    "description": "ToSStrings..ctor"
  },
  "Paragraph6": {
    "message": "Der Service wird so bereitgestellt wie er ist. Im Falle von Missbrauch, kontaktiere darkarchon#4313 auf Discord oder trete dem Mare Synchronos Discord bei. Um diese Konditionen zu akzeptieren, halte STRG gedrückt während du \"Stimme zu\" klickst.",
    "description": "ToSStrings..ctor"
  },
  "AgreeLabel": {
    "message": "Stimme zu",
    "description": "ToSStrings..ctor"
  },
  "RemainingLabel": {
    "message": "übrig",
    "description": "ToSStrings..ctor"
  },
  "FailedLabel": {
    "message": "Gratulation. Du bist daran gescheitert die Nutzungsbedingungen zu lesen.",
    "description": "ToSStrings..ctor"
  },
  "TimeoutLabel": {
    "message": "Ich gebe dir nun 1 Minute um die Nutzungsbedingungen nochmals sorgfälig zu lesen. Falls du wieder scheiterst, musst du ein nerviges Puzzle lösen.",
    "description": "ToSStrings..ctor"
  },
  "FailedAgainLabel": {
    "message": "Gratulation. Du bist daran gescheitert die Nutzungsbedingungen zu lesen. Schon wieder.",
    "description": "ToSStrings..ctor"
  },
  "PuzzleLabel": {
    "message": "Ich habe dich gewarnt. Hier ist dein nerviges Puzzle:",
    "description": "ToSStrings..ctor"
  },
  "PuzzleDescLabel": {
    "message": "Gib die 3 folgenden Wörter der Nutzungsbedingungen ohne Zeichensetzung exakt wie im Text ein um den \"Stimme zu\" Knopf wieder sichtbar zu machen.",
    "description": "ToSStrings..ctor"
  },
  "ParagraphLabel": {
    "message": "Paragraph",
    "description": "ToSStrings..ctor"
  },
  "SentenceLabel": {
    "message": "Satz",
    "description": "ToSStrings..ctor"
  },
  "WordLabel": {
    "message": "Wort",
    "description": "ToSStrings..ctor"
  }
}