{
  "LanguageLabel": {
    "message": "Language",
    "description": "ToSStrings..ctor"
  },
  "AgreementLabel": {
    "message": "Conditions d'Utilisation",
    "description": "ToSStrings..ctor"
  },
  "ReadLabel": {
    "message": "LISEZ CES INFORMATIONS ATTENTIVEMENT",
    "description": "ToSStrings..ctor"
  },
  "Paragraph1": {
    "message": "Tous les fichiers moddés actuellement en cours d'utilisation ainsi que le statut actuel de votre personnage vont être mix en ligne via le service sur lequel vous vous êtes automatiquement enregistré. Seuls les fichiers nécessaires seront téléversés par le plugin et non pas le mod en entier.",
    "description": "ToSStrings..ctor"
  },
  "Paragraph2": {
    "message": "Si le débit de votre connexion internet est limité, le téléchargement et téléversement d'un grand nombre de fichiers peut entraîner des coûts supplémentaires. Les fichiers seront compressés au chargement et versement pour réduire l'impact sur votre bande passants. Selon la rapidité de vos téléchargements et téléversements, les changements ne seront peut-être pas visibles instantanément sur les personnages. Les fichiers déja présents sur le service qui correspondent à ceux de vos mods en cours d'utilisation ne seront pas remis en ligne.",
    "description": "ToSStrings..ctor"
  },
  "Paragraph3": {
    "message": "Les fichiers que vous allez partager sont confidentiels et ne seront envoyés qu'aux utilisateurs qui feront une requête exacte de ceux-çi. Nous vous demandons de (re)considérer qui sera synchronisé avec vous, puisqu'ils recevront et stockeront inévitablement en local les fichiers nécéssaires utilisés à cet instant. Les noms des fichiers stockés localement sont changés de manière arbitraire afin de décourager toute tentative de réplication des originaux.",
    "description": "ToSStrings..ctor"
  },
  "Paragraph4": {
    "message": "Le créateur de ce plugin a tenté de sécuriser l'application du mieux possible. Cependant, il ne peut pas garantir une protection 100% infaillible. Pour votre sécurité, ne vous synchronisez pas aveuglément et avec n'importe qui.",
    "description": "ToSStrings..ctor"
  },
  "Paragraph5": {
    "message": "Les fichiers sauvegardés sur le service resteront en ligne tant que des utilisateurs en feront usage. Ils seront effacés automatiquement après une certaine période d'inactivité. Vous pouvez également demander l'effacement de tous les fichiers que vous avez mis en ligne vous-même. Le service en soi ne contient aucune information pouvant identifier quel fichier appartient à quel mod.",
    "description": "ToSStrings..ctor"
  },
  "Paragraph6": {
    "message": "Ce service et ses composants vous sont fournis en l'état. En cas d'abus rejoindre le serveur Discord Mare Synchronos.",
    "description": "ToSStrings..ctor"
  },
  "AgreeLabel": {
    "message": "J'accept",
    "description": "ToSStrings..ctor"
  },
  "ButtonWillBeAvailableIn": {
    "message": "Bouton \"J'accept\" disposible dans",
    "description": "ToSStrings..ctor"
  }
}